zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/** Number of instances of the NETC_SW_COMMON module. */
#define NETC_SW_COMMON_INSTANCE_COUNT            (1u)

/* NETC_SW_COMMON - Peripheral instance base addresses */
/** Peripheral NETC__SW0_COMMON base address */
#define IP_NETC__SW0_COMMON_BASE                 (0x6D001000u)
/** Peripheral NETC__SW0_COMMON base pointer */
#define IP_NETC__SW0_COMMON                      ((NETC_SW_COMMON_Type *)IP_NETC__SW0_COMMON_BASE)
/** Array initializer of NETC_SW_COMMON peripheral base addresses */
#define IP_NETC_SW_COMMON_BASE_ADDRS             { IP_NETC__SW0_COMMON_BASE }
/** Array initializer of NETC_SW_COMMON peripheral base pointers */
#define IP_NETC_SW_COMMON_BASE_PTRS              { IP_NETC__SW0_COMMON }

/* ----------------------------------------------------------------------------
   -- NETC_SW_COMMON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_SW_COMMON_Register_Masks NETC_SW_COMMON Register Masks
 * @{
 */

/*! @name IPCAPR - Ingress port capability register */
/*! @{ */

#define NETC_SW_COMMON_IPCAPR_RP_MASK            (0x1U)
#define NETC_SW_COMMON_IPCAPR_RP_SHIFT           (0U)
#define NETC_SW_COMMON_IPCAPR_RP_WIDTH           (1U)
#define NETC_SW_COMMON_IPCAPR_RP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPCAPR_RP_SHIFT)) & NETC_SW_COMMON_IPCAPR_RP_MASK)

#define NETC_SW_COMMON_IPCAPR_IPFLT_MASK         (0x2U)
#define NETC_SW_COMMON_IPCAPR_IPFLT_SHIFT        (1U)
#define NETC_SW_COMMON_IPCAPR_IPFLT_WIDTH        (1U)
#define NETC_SW_COMMON_IPCAPR_IPFLT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPCAPR_IPFLT_SHIFT)) & NETC_SW_COMMON_IPCAPR_IPFLT_MASK)

#define NETC_SW_COMMON_IPCAPR_ISID_MASK          (0x4U)
#define NETC_SW_COMMON_IPCAPR_ISID_SHIFT         (2U)
#define NETC_SW_COMMON_IPCAPR_ISID_WIDTH         (1U)
#define NETC_SW_COMMON_IPCAPR_ISID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPCAPR_ISID_SHIFT)) & NETC_SW_COMMON_IPCAPR_ISID_MASK)

#define NETC_SW_COMMON_IPCAPR_SDU_MASK           (0x1F00U)
#define NETC_SW_COMMON_IPCAPR_SDU_SHIFT          (8U)
#define NETC_SW_COMMON_IPCAPR_SDU_WIDTH          (5U)
#define NETC_SW_COMMON_IPCAPR_SDU(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPCAPR_SDU_SHIFT)) & NETC_SW_COMMON_IPCAPR_SDU_MASK)

#define NETC_SW_COMMON_IPCAPR_NUM_VQMP_MASK      (0xF0000U)
#define NETC_SW_COMMON_IPCAPR_NUM_VQMP_SHIFT     (16U)
#define NETC_SW_COMMON_IPCAPR_NUM_VQMP_WIDTH     (4U)
#define NETC_SW_COMMON_IPCAPR_NUM_VQMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPCAPR_NUM_VQMP_SHIFT)) & NETC_SW_COMMON_IPCAPR_NUM_VQMP_MASK)
/*! @} */

/*! @name EPCAPR - Egress port capability register */
/*! @{ */

#define NETC_SW_COMMON_EPCAPR_ET_MASK            (0x1U)
#define NETC_SW_COMMON_EPCAPR_ET_SHIFT           (0U)
#define NETC_SW_COMMON_EPCAPR_ET_WIDTH           (1U)
#define NETC_SW_COMMON_EPCAPR_ET(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EPCAPR_ET_SHIFT)) & NETC_SW_COMMON_EPCAPR_ET_MASK)

#define NETC_SW_COMMON_EPCAPR_SDU_MASK           (0x1F00U)
#define NETC_SW_COMMON_EPCAPR_SDU_SHIFT          (8U)
#define NETC_SW_COMMON_EPCAPR_SDU_WIDTH          (5U)
#define NETC_SW_COMMON_EPCAPR_SDU(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EPCAPR_SDU_SHIFT)) & NETC_SW_COMMON_EPCAPR_SDU_MASK)

#define NETC_SW_COMMON_EPCAPR_NUM_QVMP_MASK      (0xF0000U)
#define NETC_SW_COMMON_EPCAPR_NUM_QVMP_SHIFT     (16U)
#define NETC_SW_COMMON_EPCAPR_NUM_QVMP_WIDTH     (4U)
#define NETC_SW_COMMON_EPCAPR_NUM_QVMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EPCAPR_NUM_QVMP_SHIFT)) & NETC_SW_COMMON_EPCAPR_NUM_QVMP_MASK)
/*! @} */

/*! @name EVMCAPR - Event monitor capability register */
/*! @{ */

#define NETC_SW_COMMON_EVMCAPR_NUM_EVM_MASK      (0x3FU)
#define NETC_SW_COMMON_EVMCAPR_NUM_EVM_SHIFT     (0U)
#define NETC_SW_COMMON_EVMCAPR_NUM_EVM_WIDTH     (6U)
#define NETC_SW_COMMON_EVMCAPR_NUM_EVM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCAPR_NUM_EVM_SHIFT)) & NETC_SW_COMMON_EVMCAPR_NUM_EVM_MASK)
/*! @} */

/*! @name OSR - Operational state register */
/*! @{ */

#define NETC_SW_COMMON_OSR_STATE_MASK            (0x1U)
#define NETC_SW_COMMON_OSR_STATE_SHIFT           (0U)
#define NETC_SW_COMMON_OSR_STATE_WIDTH           (1U)
#define NETC_SW_COMMON_OSR_STATE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_OSR_STATE_SHIFT)) & NETC_SW_COMMON_OSR_STATE_MASK)

#define NETC_SW_COMMON_OSR_ITM_STATE_MASK        (0x2U)
#define NETC_SW_COMMON_OSR_ITM_STATE_SHIFT       (1U)
#define NETC_SW_COMMON_OSR_ITM_STATE_WIDTH       (1U)
#define NETC_SW_COMMON_OSR_ITM_STATE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_OSR_ITM_STATE_SHIFT)) & NETC_SW_COMMON_OSR_ITM_STATE_MASK)
/*! @} */

/*! @name SWCR - Switch configuration register */
/*! @{ */

#define NETC_SW_COMMON_SWCR_SWID_MASK            (0x7U)
#define NETC_SW_COMMON_SWCR_SWID_SHIFT           (0U)
#define NETC_SW_COMMON_SWCR_SWID_WIDTH           (3U)
#define NETC_SW_COMMON_SWCR_SWID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SWCR_SWID_SHIFT)) & NETC_SW_COMMON_SWCR_SWID_MASK)
/*! @} */

/*! @name NSTCR - NS Tag configuration register */
/*! @{ */

#define NETC_SW_COMMON_NSTCR_ETHERTYPE_MASK      (0xFFFFU)
#define NETC_SW_COMMON_NSTCR_ETHERTYPE_SHIFT     (0U)
#define NETC_SW_COMMON_NSTCR_ETHERTYPE_WIDTH     (16U)
#define NETC_SW_COMMON_NSTCR_ETHERTYPE(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_NSTCR_ETHERTYPE_SHIFT)) & NETC_SW_COMMON_NSTCR_ETHERTYPE_MASK)
/*! @} */

/*! @name MPCR - Management port configuration register */
/*! @{ */

#define NETC_SW_COMMON_MPCR_PORT_MASK            (0x1FU)
#define NETC_SW_COMMON_MPCR_PORT_SHIFT           (0U)
#define NETC_SW_COMMON_MPCR_PORT_WIDTH           (5U)
#define NETC_SW_COMMON_MPCR_PORT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MPCR_PORT_SHIFT)) & NETC_SW_COMMON_MPCR_PORT_MASK)

#define NETC_SW_COMMON_MPCR_SWID_MASK            (0xE0U)
#define NETC_SW_COMMON_MPCR_SWID_SHIFT           (5U)
#define NETC_SW_COMMON_MPCR_SWID_WIDTH           (3U)
#define NETC_SW_COMMON_MPCR_SWID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MPCR_SWID_SHIFT)) & NETC_SW_COMMON_MPCR_SWID_MASK)
/*! @} */

/*! @name CMECR - Correctable memory error configuration register */
/*! @{ */

#define NETC_SW_COMMON_CMECR_THRESHOLD_MASK      (0xFFU)
#define NETC_SW_COMMON_CMECR_THRESHOLD_SHIFT     (0U)
#define NETC_SW_COMMON_CMECR_THRESHOLD_WIDTH     (8U)
#define NETC_SW_COMMON_CMECR_THRESHOLD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CMECR_THRESHOLD_SHIFT)) & NETC_SW_COMMON_CMECR_THRESHOLD_MASK)
/*! @} */

/*! @name CMESR - Correctable memory error status register */
/*! @{ */

