zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_CMESR_LINK_SLICE_ID_MASK  (0x1FU)
#define NETC_SW_COMMON_CMESR_LINK_SLICE_ID_SHIFT (0U)
#define NETC_SW_COMMON_CMESR_LINK_SLICE_ID_WIDTH (5U)
#define NETC_SW_COMMON_CMESR_LINK_SLICE_ID(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CMESR_LINK_SLICE_ID_SHIFT)) & NETC_SW_COMMON_CMESR_LINK_SLICE_ID_MASK)

#define NETC_SW_COMMON_CMESR_MEM_ID_MASK         (0x1F00U)
#define NETC_SW_COMMON_CMESR_MEM_ID_SHIFT        (8U)
#define NETC_SW_COMMON_CMESR_MEM_ID_WIDTH        (5U)
#define NETC_SW_COMMON_CMESR_MEM_ID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CMESR_MEM_ID_SHIFT)) & NETC_SW_COMMON_CMESR_MEM_ID_MASK)

#define NETC_SW_COMMON_CMESR_SBEE_MASK           (0x80000000U)
#define NETC_SW_COMMON_CMESR_SBEE_SHIFT          (31U)
#define NETC_SW_COMMON_CMESR_SBEE_WIDTH          (1U)
#define NETC_SW_COMMON_CMESR_SBEE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CMESR_SBEE_SHIFT)) & NETC_SW_COMMON_CMESR_SBEE_MASK)
/*! @} */

/*! @name CMECTR - Correctable memory error count register */
/*! @{ */

#define NETC_SW_COMMON_CMECTR_COUNT_MASK         (0xFFU)
#define NETC_SW_COMMON_CMECTR_COUNT_SHIFT        (0U)
#define NETC_SW_COMMON_CMECTR_COUNT_WIDTH        (8U)
#define NETC_SW_COMMON_CMECTR_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CMECTR_COUNT_SHIFT)) & NETC_SW_COMMON_CMECTR_COUNT_MASK)
/*! @} */

/*! @name UNMACECR - Uncorrectable non-fatal MAC error configuration register */
/*! @{ */

#define NETC_SW_COMMON_UNMACECR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_UNMACECR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_UNMACECR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT0_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT0_MASK)

#define NETC_SW_COMMON_UNMACECR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_UNMACECR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT1_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT1_MASK)

#define NETC_SW_COMMON_UNMACECR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_UNMACECR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_UNMACECR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT2_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT2_MASK)

#define NETC_SW_COMMON_UNMACECR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_UNMACECR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_UNMACECR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT3_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT3_MASK)

#define NETC_SW_COMMON_UNMACECR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_UNMACECR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_UNMACECR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT4_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT4_MASK)

#define NETC_SW_COMMON_UNMACECR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_UNMACECR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_UNMACECR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACECR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACECR_PORT5_SHIFT)) & NETC_SW_COMMON_UNMACECR_PORT5_MASK)
/*! @} */

/*! @name UNMACESR - Uncorrectable non-fatal MAC error status register */
/*! @{ */

#define NETC_SW_COMMON_UNMACESR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_UNMACESR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_UNMACESR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT0_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT0_MASK)

#define NETC_SW_COMMON_UNMACESR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_UNMACESR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT1_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT1_MASK)

#define NETC_SW_COMMON_UNMACESR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_UNMACESR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_UNMACESR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT2_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT2_MASK)

#define NETC_SW_COMMON_UNMACESR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_UNMACESR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_UNMACESR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT3_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT3_MASK)

#define NETC_SW_COMMON_UNMACESR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_UNMACESR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_UNMACESR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT4_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT4_MASK)

#define NETC_SW_COMMON_UNMACESR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_UNMACESR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_UNMACESR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_UNMACESR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMACESR_PORT5_SHIFT)) & NETC_SW_COMMON_UNMACESR_PORT5_MASK)
/*! @} */

/*! @name UFMACECR - Uncorrectable fatal MAC error configuration register */
/*! @{ */

#define NETC_SW_COMMON_UFMACECR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_UFMACECR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_UFMACECR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT0_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT0_MASK)

#define NETC_SW_COMMON_UFMACECR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_UFMACECR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT1_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT1_MASK)

#define NETC_SW_COMMON_UFMACECR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_UFMACECR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_UFMACECR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT2_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT2_MASK)

#define NETC_SW_COMMON_UFMACECR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_UFMACECR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_UFMACECR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT3_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT3_MASK)

