zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_UFMACECR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_UFMACECR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_UFMACECR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT4_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT4_MASK)

#define NETC_SW_COMMON_UFMACECR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_UFMACECR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_UFMACECR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACECR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACECR_PORT5_SHIFT)) & NETC_SW_COMMON_UFMACECR_PORT5_MASK)
/*! @} */

/*! @name UFMACESR - Uncorrectable fatal MAC error status register */
/*! @{ */

#define NETC_SW_COMMON_UFMACESR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_UFMACESR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_UFMACESR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT0_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT0_MASK)

#define NETC_SW_COMMON_UFMACESR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_UFMACESR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT1_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT1_MASK)

#define NETC_SW_COMMON_UFMACESR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_UFMACESR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_UFMACESR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT2_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT2_MASK)

#define NETC_SW_COMMON_UFMACESR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_UFMACESR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_UFMACESR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT3_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT3_MASK)

#define NETC_SW_COMMON_UFMACESR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_UFMACESR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_UFMACESR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT4_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT4_MASK)

#define NETC_SW_COMMON_UFMACESR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_UFMACESR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_UFMACESR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_UFMACESR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFMACESR_PORT5_SHIFT)) & NETC_SW_COMMON_UFMACESR_PORT5_MASK)
/*! @} */

/*! @name UNSBECR - Uncorrectable non-fatal system bus error configuration register */
/*! @{ */

#define NETC_SW_COMMON_UNSBECR_THRESHOLD_MASK    (0xFFU)
#define NETC_SW_COMMON_UNSBECR_THRESHOLD_SHIFT   (0U)
#define NETC_SW_COMMON_UNSBECR_THRESHOLD_WIDTH   (8U)
#define NETC_SW_COMMON_UNSBECR_THRESHOLD(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNSBECR_THRESHOLD_SHIFT)) & NETC_SW_COMMON_UNSBECR_THRESHOLD_MASK)
/*! @} */

/*! @name UNSBESR - Uncorrectable non-fatal system bus error status register */
/*! @{ */

#define NETC_SW_COMMON_UNSBESR_SB_ID_MASK        (0xF00U)
#define NETC_SW_COMMON_UNSBESR_SB_ID_SHIFT       (8U)
#define NETC_SW_COMMON_UNSBESR_SB_ID_WIDTH       (4U)
#define NETC_SW_COMMON_UNSBESR_SB_ID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNSBESR_SB_ID_SHIFT)) & NETC_SW_COMMON_UNSBESR_SB_ID_MASK)

#define NETC_SW_COMMON_UNSBESR_SBE_MASK          (0x80000000U)
#define NETC_SW_COMMON_UNSBESR_SBE_SHIFT         (31U)
#define NETC_SW_COMMON_UNSBESR_SBE_WIDTH         (1U)
#define NETC_SW_COMMON_UNSBESR_SBE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNSBESR_SBE_SHIFT)) & NETC_SW_COMMON_UNSBESR_SBE_MASK)
/*! @} */

/*! @name UNSBECTR - Uncorrectable non-fatal system bus error count register */
/*! @{ */

#define NETC_SW_COMMON_UNSBECTR_COUNT_MASK       (0xFFU)
#define NETC_SW_COMMON_UNSBECTR_COUNT_SHIFT      (0U)
#define NETC_SW_COMMON_UNSBECTR_COUNT_WIDTH      (8U)
#define NETC_SW_COMMON_UNSBECTR_COUNT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNSBECTR_COUNT_SHIFT)) & NETC_SW_COMMON_UNSBECTR_COUNT_MASK)
/*! @} */

/*! @name UFSBECR - Uncorrectable fatal system bus error configuration register */
/*! @{ */

#define NETC_SW_COMMON_UFSBECR_RD_MASK           (0x80000000U)
#define NETC_SW_COMMON_UFSBECR_RD_SHIFT          (31U)
#define NETC_SW_COMMON_UFSBECR_RD_WIDTH          (1U)
#define NETC_SW_COMMON_UFSBECR_RD(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFSBECR_RD_SHIFT)) & NETC_SW_COMMON_UFSBECR_RD_MASK)
/*! @} */

/*! @name UFSBESR - Uncorrectable fatal system bus error status register */
/*! @{ */

#define NETC_SW_COMMON_UFSBESR_SB_ID_MASK        (0xF00U)
#define NETC_SW_COMMON_UFSBESR_SB_ID_SHIFT       (8U)
#define NETC_SW_COMMON_UFSBESR_SB_ID_WIDTH       (4U)
#define NETC_SW_COMMON_UFSBESR_SB_ID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFSBESR_SB_ID_SHIFT)) & NETC_SW_COMMON_UFSBESR_SB_ID_MASK)

#define NETC_SW_COMMON_UFSBESR_M_MASK            (0x40000000U)
#define NETC_SW_COMMON_UFSBESR_M_SHIFT           (30U)
#define NETC_SW_COMMON_UFSBESR_M_WIDTH           (1U)
#define NETC_SW_COMMON_UFSBESR_M(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFSBESR_M_SHIFT)) & NETC_SW_COMMON_UFSBESR_M_MASK)

#define NETC_SW_COMMON_UFSBESR_SBE_MASK          (0x80000000U)
#define NETC_SW_COMMON_UFSBESR_SBE_SHIFT         (31U)
#define NETC_SW_COMMON_UFSBESR_SBE_WIDTH         (1U)
#define NETC_SW_COMMON_UFSBESR_SBE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFSBESR_SBE_SHIFT)) & NETC_SW_COMMON_UFSBESR_SBE_MASK)
/*! @} */

/*! @name UNMECR - Uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define NETC_SW_COMMON_UNMECR_THRESHOLD_MASK     (0xFFU)
#define NETC_SW_COMMON_UNMECR_THRESHOLD_SHIFT    (0U)
#define NETC_SW_COMMON_UNMECR_THRESHOLD_WIDTH    (8U)
#define NETC_SW_COMMON_UNMECR_THRESHOLD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMECR_THRESHOLD_SHIFT)) & NETC_SW_COMMON_UNMECR_THRESHOLD_MASK)

#define NETC_SW_COMMON_UNMECR_RD_MASK            (0x80000000U)
#define NETC_SW_COMMON_UNMECR_RD_SHIFT           (31U)
#define NETC_SW_COMMON_UNMECR_RD_WIDTH           (1U)
#define NETC_SW_COMMON_UNMECR_RD(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMECR_RD_SHIFT)) & NETC_SW_COMMON_UNMECR_RD_MASK)
/*! @} */

/*! @name UNMESR0 - Uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID_MASK (0x1FU)
#define NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID_SHIFT (0U)
#define NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID_WIDTH (5U)
#define NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID_SHIFT)) & NETC_SW_COMMON_UNMESR0_LINK_SLICE_ID_MASK)

#define NETC_SW_COMMON_UNMESR0_MEM_ID_MASK       (0x1F00U)
#define NETC_SW_COMMON_UNMESR0_MEM_ID_SHIFT      (8U)
#define NETC_SW_COMMON_UNMESR0_MEM_ID_WIDTH      (5U)
#define NETC_SW_COMMON_UNMESR0_MEM_ID(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMESR0_MEM_ID_SHIFT)) & NETC_SW_COMMON_UNMESR0_MEM_ID_MASK)

#define NETC_SW_COMMON_UNMESR0_SYNDROME_MASK     (0x7FF0000U)
#define NETC_SW_COMMON_UNMESR0_SYNDROME_SHIFT    (16U)
#define NETC_SW_COMMON_UNMESR0_SYNDROME_WIDTH    (11U)
#define NETC_SW_COMMON_UNMESR0_SYNDROME(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMESR0_SYNDROME_SHIFT)) & NETC_SW_COMMON_UNMESR0_SYNDROME_MASK)

#define NETC_SW_COMMON_UNMESR0_MBEE_MASK         (0x80000000U)
#define NETC_SW_COMMON_UNMESR0_MBEE_SHIFT        (31U)
#define NETC_SW_COMMON_UNMESR0_MBEE_WIDTH        (1U)
#define NETC_SW_COMMON_UNMESR0_MBEE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMESR0_MBEE_SHIFT)) & NETC_SW_COMMON_UNMESR0_MBEE_MASK)
/*! @} */

/*! @name UNMESR1 - Uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define NETC_SW_COMMON_UNMESR1_ADDR_MASK         (0xFFFFFFFFU)
#define NETC_SW_COMMON_UNMESR1_ADDR_SHIFT        (0U)
#define NETC_SW_COMMON_UNMESR1_ADDR_WIDTH        (32U)
#define NETC_SW_COMMON_UNMESR1_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMESR1_ADDR_SHIFT)) & NETC_SW_COMMON_UNMESR1_ADDR_MASK)
/*! @} */

/*! @name UNMECTR - Uncorrectable non-fatal memory error count register */
/*! @{ */

#define NETC_SW_COMMON_UNMECTR_COUNT_MASK        (0xFFU)
#define NETC_SW_COMMON_UNMECTR_COUNT_SHIFT       (0U)
#define NETC_SW_COMMON_UNMECTR_COUNT_WIDTH       (8U)
#define NETC_SW_COMMON_UNMECTR_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UNMECTR_COUNT_SHIFT)) & NETC_SW_COMMON_UNMECTR_COUNT_MASK)
/*! @} */

/*! @name UFMECR - Uncorrectable fatal memory error configuration register */
/*! @{ */

