zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/*! @name UFIESR - Uncorrectable fatal integrity error status register */
/*! @{ */

#define NETC_SW_COMMON_UFIESR_LINK_SLICE_ID_MASK (0x1FU)
#define NETC_SW_COMMON_UFIESR_LINK_SLICE_ID_SHIFT (0U)
#define NETC_SW_COMMON_UFIESR_LINK_SLICE_ID_WIDTH (5U)
#define NETC_SW_COMMON_UFIESR_LINK_SLICE_ID(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_LINK_SLICE_ID_SHIFT)) & NETC_SW_COMMON_UFIESR_LINK_SLICE_ID_MASK)

#define NETC_SW_COMMON_UFIESR_BLOCK_ID_MASK      (0x1F00U)
#define NETC_SW_COMMON_UFIESR_BLOCK_ID_SHIFT     (8U)
#define NETC_SW_COMMON_UFIESR_BLOCK_ID_WIDTH     (5U)
#define NETC_SW_COMMON_UFIESR_BLOCK_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_BLOCK_ID_SHIFT)) & NETC_SW_COMMON_UFIESR_BLOCK_ID_MASK)

#define NETC_SW_COMMON_UFIESR_SM_ID_MASK         (0x3F0000U)
#define NETC_SW_COMMON_UFIESR_SM_ID_SHIFT        (16U)
#define NETC_SW_COMMON_UFIESR_SM_ID_WIDTH        (6U)
#define NETC_SW_COMMON_UFIESR_SM_ID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_SM_ID_SHIFT)) & NETC_SW_COMMON_UFIESR_SM_ID_MASK)

#define NETC_SW_COMMON_UFIESR_ENGINE_ID_MASK     (0x1000000U)
#define NETC_SW_COMMON_UFIESR_ENGINE_ID_SHIFT    (24U)
#define NETC_SW_COMMON_UFIESR_ENGINE_ID_WIDTH    (1U)
#define NETC_SW_COMMON_UFIESR_ENGINE_ID(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_ENGINE_ID_SHIFT)) & NETC_SW_COMMON_UFIESR_ENGINE_ID_MASK)

#define NETC_SW_COMMON_UFIESR_M_MASK             (0x40000000U)
#define NETC_SW_COMMON_UFIESR_M_SHIFT            (30U)
#define NETC_SW_COMMON_UFIESR_M_WIDTH            (1U)
#define NETC_SW_COMMON_UFIESR_M(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_M_SHIFT)) & NETC_SW_COMMON_UFIESR_M_MASK)

#define NETC_SW_COMMON_UFIESR_INTERR_MASK        (0x80000000U)
#define NETC_SW_COMMON_UFIESR_INTERR_SHIFT       (31U)
#define NETC_SW_COMMON_UFIESR_INTERR_WIDTH       (1U)
#define NETC_SW_COMMON_UFIESR_INTERR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_UFIESR_INTERR_SHIFT)) & NETC_SW_COMMON_UFIESR_INTERR_MASK)
/*! @} */

/*! @name MIRR - MAC interrupt reason register */
/*! @{ */

#define NETC_SW_COMMON_MIRR_PORT0_MASK           (0x1U)
#define NETC_SW_COMMON_MIRR_PORT0_SHIFT          (0U)
#define NETC_SW_COMMON_MIRR_PORT0_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT0(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT0_SHIFT)) & NETC_SW_COMMON_MIRR_PORT0_MASK)

#define NETC_SW_COMMON_MIRR_PORT1_MASK           (0x2U)
#define NETC_SW_COMMON_MIRR_PORT1_SHIFT          (1U)
#define NETC_SW_COMMON_MIRR_PORT1_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT1(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT1_SHIFT)) & NETC_SW_COMMON_MIRR_PORT1_MASK)

#define NETC_SW_COMMON_MIRR_PORT2_MASK           (0x4U)
#define NETC_SW_COMMON_MIRR_PORT2_SHIFT          (2U)
#define NETC_SW_COMMON_MIRR_PORT2_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT2(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT2_SHIFT)) & NETC_SW_COMMON_MIRR_PORT2_MASK)

#define NETC_SW_COMMON_MIRR_PORT3_MASK           (0x8U)
#define NETC_SW_COMMON_MIRR_PORT3_SHIFT          (3U)
#define NETC_SW_COMMON_MIRR_PORT3_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT3(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT3_SHIFT)) & NETC_SW_COMMON_MIRR_PORT3_MASK)

#define NETC_SW_COMMON_MIRR_PORT4_MASK           (0x10U)
#define NETC_SW_COMMON_MIRR_PORT4_SHIFT          (4U)
#define NETC_SW_COMMON_MIRR_PORT4_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT4(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT4_SHIFT)) & NETC_SW_COMMON_MIRR_PORT4_MASK)

#define NETC_SW_COMMON_MIRR_PORT5_MASK           (0x20U)
#define NETC_SW_COMMON_MIRR_PORT5_SHIFT          (5U)
#define NETC_SW_COMMON_MIRR_PORT5_WIDTH          (1U)
#define NETC_SW_COMMON_MIRR_PORT5(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MIRR_PORT5_SHIFT)) & NETC_SW_COMMON_MIRR_PORT5_MASK)
/*! @} */

/*! @name MMSIVR - MAC MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_MMSIVR_VECTOR_MASK        (0xFU)
#define NETC_SW_COMMON_MMSIVR_VECTOR_SHIFT       (0U)
#define NETC_SW_COMMON_MMSIVR_VECTOR_WIDTH       (4U)
#define NETC_SW_COMMON_MMSIVR_VECTOR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_MMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_MMSIVR_VECTOR_MASK)
/*! @} */

/*! @name PCSIRR - PCS interrupt reason register */
/*! @{ */

#define NETC_SW_COMMON_PCSIRR_PORT0_MASK         (0x1U)
#define NETC_SW_COMMON_PCSIRR_PORT0_SHIFT        (0U)
#define NETC_SW_COMMON_PCSIRR_PORT0_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT0_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT0_MASK)

#define NETC_SW_COMMON_PCSIRR_PORT1_MASK         (0x2U)
#define NETC_SW_COMMON_PCSIRR_PORT1_SHIFT        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT1_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT1_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT1_MASK)

#define NETC_SW_COMMON_PCSIRR_PORT2_MASK         (0x4U)
#define NETC_SW_COMMON_PCSIRR_PORT2_SHIFT        (2U)
#define NETC_SW_COMMON_PCSIRR_PORT2_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT2_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT2_MASK)

#define NETC_SW_COMMON_PCSIRR_PORT3_MASK         (0x8U)
#define NETC_SW_COMMON_PCSIRR_PORT3_SHIFT        (3U)
#define NETC_SW_COMMON_PCSIRR_PORT3_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT3_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT3_MASK)

#define NETC_SW_COMMON_PCSIRR_PORT4_MASK         (0x10U)
#define NETC_SW_COMMON_PCSIRR_PORT4_SHIFT        (4U)
#define NETC_SW_COMMON_PCSIRR_PORT4_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT4(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT4_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT4_MASK)

