zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_PCSIRR_PORT5_MASK         (0x20U)
#define NETC_SW_COMMON_PCSIRR_PORT5_SHIFT        (5U)
#define NETC_SW_COMMON_PCSIRR_PORT5_WIDTH        (1U)
#define NETC_SW_COMMON_PCSIRR_PORT5(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSIRR_PORT5_SHIFT)) & NETC_SW_COMMON_PCSIRR_PORT5_MASK)
/*! @} */

/*! @name PCSMSIVR - PCS MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_PCSMSIVR_VECTOR_MASK      (0xFU)
#define NETC_SW_COMMON_PCSMSIVR_VECTOR_SHIFT     (0U)
#define NETC_SW_COMMON_PCSMSIVR_VECTOR_WIDTH     (4U)
#define NETC_SW_COMMON_PCSMSIVR_VECTOR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PCSMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_PCSMSIVR_VECTOR_MASK)
/*! @} */

/*! @name IMDIOIRR - Internal MDIO interrupt reason register */
/*! @{ */

#define NETC_SW_COMMON_IMDIOIRR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_IMDIOIRR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT0_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT0_MASK)

#define NETC_SW_COMMON_IMDIOIRR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_IMDIOIRR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT1_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT1_MASK)

#define NETC_SW_COMMON_IMDIOIRR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_IMDIOIRR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_IMDIOIRR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT2_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT2_MASK)

#define NETC_SW_COMMON_IMDIOIRR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_IMDIOIRR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_IMDIOIRR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT3_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT3_MASK)

#define NETC_SW_COMMON_IMDIOIRR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_IMDIOIRR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_IMDIOIRR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT4_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT4_MASK)

#define NETC_SW_COMMON_IMDIOIRR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_IMDIOIRR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_IMDIOIRR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_IMDIOIRR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOIRR_PORT5_SHIFT)) & NETC_SW_COMMON_IMDIOIRR_PORT5_MASK)
/*! @} */

/*! @name IMDIOMSIVR - Internal MDIO MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_IMDIOMSIVR_VECTOR_MASK    (0xFU)
#define NETC_SW_COMMON_IMDIOMSIVR_VECTOR_SHIFT   (0U)
#define NETC_SW_COMMON_IMDIOMSIVR_VECTOR_WIDTH   (4U)
#define NETC_SW_COMMON_IMDIOMSIVR_VECTOR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IMDIOMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_IMDIOMSIVR_VECTOR_MASK)
/*! @} */

/*! @name EMDIOIRR - External MDIO interrupt reason register */
/*! @{ */

#define NETC_SW_COMMON_EMDIOIRR_PORT0_MASK       (0x1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT0_SHIFT      (0U)
#define NETC_SW_COMMON_EMDIOIRR_PORT0_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT0_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT0_MASK)

#define NETC_SW_COMMON_EMDIOIRR_PORT1_MASK       (0x2U)
#define NETC_SW_COMMON_EMDIOIRR_PORT1_SHIFT      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT1_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT1_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT1_MASK)

#define NETC_SW_COMMON_EMDIOIRR_PORT2_MASK       (0x4U)
#define NETC_SW_COMMON_EMDIOIRR_PORT2_SHIFT      (2U)
#define NETC_SW_COMMON_EMDIOIRR_PORT2_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT2_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT2_MASK)

#define NETC_SW_COMMON_EMDIOIRR_PORT3_MASK       (0x8U)
#define NETC_SW_COMMON_EMDIOIRR_PORT3_SHIFT      (3U)
#define NETC_SW_COMMON_EMDIOIRR_PORT3_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT3_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT3_MASK)

#define NETC_SW_COMMON_EMDIOIRR_PORT4_MASK       (0x10U)
#define NETC_SW_COMMON_EMDIOIRR_PORT4_SHIFT      (4U)
#define NETC_SW_COMMON_EMDIOIRR_PORT4_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT4_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT4_MASK)

#define NETC_SW_COMMON_EMDIOIRR_PORT5_MASK       (0x20U)
#define NETC_SW_COMMON_EMDIOIRR_PORT5_SHIFT      (5U)
#define NETC_SW_COMMON_EMDIOIRR_PORT5_WIDTH      (1U)
#define NETC_SW_COMMON_EMDIOIRR_PORT5(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOIRR_PORT5_SHIFT)) & NETC_SW_COMMON_EMDIOIRR_PORT5_MASK)
/*! @} */

/*! @name EMDIOMSIVR - External MDIO MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_EMDIOMSIVR_VECTOR_MASK    (0xFU)
#define NETC_SW_COMMON_EMDIOMSIVR_VECTOR_SHIFT   (0U)
#define NETC_SW_COMMON_EMDIOMSIVR_VECTOR_WIDTH   (4U)
#define NETC_SW_COMMON_EMDIOMSIVR_VECTOR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EMDIOMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_EMDIOMSIVR_VECTOR_MASK)
/*! @} */

/*! @name TCCR - Time capture configuration register */
/*! @{ */

#define NETC_SW_COMMON_TCCR_TIMEOUT_MASK         (0xFFFFFFU)
#define NETC_SW_COMMON_TCCR_TIMEOUT_SHIFT        (0U)
#define NETC_SW_COMMON_TCCR_TIMEOUT_WIDTH        (24U)
#define NETC_SW_COMMON_TCCR_TIMEOUT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCCR_TIMEOUT_SHIFT)) & NETC_SW_COMMON_TCCR_TIMEOUT_MASK)

#define NETC_SW_COMMON_TCCR_ARM_MASK             (0xC0000000U)
#define NETC_SW_COMMON_TCCR_ARM_SHIFT            (30U)
#define NETC_SW_COMMON_TCCR_ARM_WIDTH            (2U)
#define NETC_SW_COMMON_TCCR_ARM(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCCR_ARM_SHIFT)) & NETC_SW_COMMON_TCCR_ARM_MASK)
/*! @} */

/*! @name TCIER - Time capture interrupt enable register */
/*! @{ */

#define NETC_SW_COMMON_TCIER_TRANSMIT_MASK       (0x40000000U)
#define NETC_SW_COMMON_TCIER_TRANSMIT_SHIFT      (30U)
#define NETC_SW_COMMON_TCIER_TRANSMIT_WIDTH      (1U)
#define NETC_SW_COMMON_TCIER_TRANSMIT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCIER_TRANSMIT_SHIFT)) & NETC_SW_COMMON_TCIER_TRANSMIT_MASK)

#define NETC_SW_COMMON_TCIER_TIMEOUT_MASK        (0x80000000U)
#define NETC_SW_COMMON_TCIER_TIMEOUT_SHIFT       (31U)
#define NETC_SW_COMMON_TCIER_TIMEOUT_WIDTH       (1U)
#define NETC_SW_COMMON_TCIER_TIMEOUT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCIER_TIMEOUT_SHIFT)) & NETC_SW_COMMON_TCIER_TIMEOUT_MASK)
/*! @} */

