zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/*! @name TCRPIDR - Time capture receive port interrupt detect register */
/*! @{ */

#define NETC_SW_COMMON_TCRPIDR_TX_PORT0_MASK     (0x1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT0_SHIFT    (0U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT0_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT0(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT0_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT0_MASK)

#define NETC_SW_COMMON_TCRPIDR_TX_PORT1_MASK     (0x2U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT1_SHIFT    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT1_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT1(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT1_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT1_MASK)

#define NETC_SW_COMMON_TCRPIDR_TX_PORT2_MASK     (0x4U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT2_SHIFT    (2U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT2_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT2(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT2_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT2_MASK)

#define NETC_SW_COMMON_TCRPIDR_TX_PORT3_MASK     (0x8U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT3_SHIFT    (3U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT3_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT3(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT3_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT3_MASK)

#define NETC_SW_COMMON_TCRPIDR_TX_PORT4_MASK     (0x10U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT4_SHIFT    (4U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT4_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT4(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT4_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT4_MASK)

#define NETC_SW_COMMON_TCRPIDR_TX_PORT5_MASK     (0x20U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT5_SHIFT    (5U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT5_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TX_PORT5(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TX_PORT5_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TX_PORT5_MASK)

#define NETC_SW_COMMON_TCRPIDR_TRANSMIT_MASK     (0x40000000U)
#define NETC_SW_COMMON_TCRPIDR_TRANSMIT_SHIFT    (30U)
#define NETC_SW_COMMON_TCRPIDR_TRANSMIT_WIDTH    (1U)
#define NETC_SW_COMMON_TCRPIDR_TRANSMIT(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TRANSMIT_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TRANSMIT_MASK)

#define NETC_SW_COMMON_TCRPIDR_TIMEOUT_MASK      (0x80000000U)
#define NETC_SW_COMMON_TCRPIDR_TIMEOUT_SHIFT     (31U)
#define NETC_SW_COMMON_TCRPIDR_TIMEOUT_WIDTH     (1U)
#define NETC_SW_COMMON_TCRPIDR_TIMEOUT(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPIDR_TIMEOUT_SHIFT)) & NETC_SW_COMMON_TCRPIDR_TIMEOUT_MASK)
/*! @} */

/*! @name TCRPSR - Time capture receive port status register */
/*! @{ */

#define NETC_SW_COMMON_TCRPSR_RX_PORT_MASK       (0x1FU)
#define NETC_SW_COMMON_TCRPSR_RX_PORT_SHIFT      (0U)
#define NETC_SW_COMMON_TCRPSR_RX_PORT_WIDTH      (5U)
#define NETC_SW_COMMON_TCRPSR_RX_PORT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPSR_RX_PORT_SHIFT)) & NETC_SW_COMMON_TCRPSR_RX_PORT_MASK)

#define NETC_SW_COMMON_TCRPSR_RX_CNT_MASK        (0x300U)
#define NETC_SW_COMMON_TCRPSR_RX_CNT_SHIFT       (8U)
#define NETC_SW_COMMON_TCRPSR_RX_CNT_WIDTH       (2U)
#define NETC_SW_COMMON_TCRPSR_RX_CNT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPSR_RX_CNT_SHIFT)) & NETC_SW_COMMON_TCRPSR_RX_CNT_MASK)
/*! @} */

/*! @name TCRPTSR - Time capture receive port timestamp register */
/*! @{ */

#define NETC_SW_COMMON_TCRPTSR_TIMESTAMP_MASK    (0xFFFFFFFFU)
#define NETC_SW_COMMON_TCRPTSR_TIMESTAMP_SHIFT   (0U)
#define NETC_SW_COMMON_TCRPTSR_TIMESTAMP_WIDTH   (32U)
#define NETC_SW_COMMON_TCRPTSR_TIMESTAMP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCRPTSR_TIMESTAMP_SHIFT)) & NETC_SW_COMMON_TCRPTSR_TIMESTAMP_MASK)
/*! @} */

/*! @name TCMSIVR - Time capture MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_TCMSIVR_VECTOR_MASK       (0xFU)
#define NETC_SW_COMMON_TCMSIVR_VECTOR_SHIFT      (0U)
#define NETC_SW_COMMON_TCMSIVR_VECTOR_WIDTH      (4U)
#define NETC_SW_COMMON_TCMSIVR_VECTOR(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TCMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_TCMSIVR_VECTOR_MASK)
/*! @} */

/*! @name EVMIER - Event monitor interrupt enable register */
/*! @{ */

#define NETC_SW_COMMON_EVMIER_EVMT0_MASK         (0x1U)
#define NETC_SW_COMMON_EVMIER_EVMT0_SHIFT        (0U)
#define NETC_SW_COMMON_EVMIER_EVMT0_WIDTH        (1U)
#define NETC_SW_COMMON_EVMIER_EVMT0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIER_EVMT0_SHIFT)) & NETC_SW_COMMON_EVMIER_EVMT0_MASK)

#define NETC_SW_COMMON_EVMIER_EVMT1_MASK         (0x2U)
#define NETC_SW_COMMON_EVMIER_EVMT1_SHIFT        (1U)
#define NETC_SW_COMMON_EVMIER_EVMT1_WIDTH        (1U)
#define NETC_SW_COMMON_EVMIER_EVMT1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIER_EVMT1_SHIFT)) & NETC_SW_COMMON_EVMIER_EVMT1_MASK)

#define NETC_SW_COMMON_EVMIER_EVMT2_MASK         (0x4U)
#define NETC_SW_COMMON_EVMIER_EVMT2_SHIFT        (2U)
#define NETC_SW_COMMON_EVMIER_EVMT2_WIDTH        (1U)
#define NETC_SW_COMMON_EVMIER_EVMT2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIER_EVMT2_SHIFT)) & NETC_SW_COMMON_EVMIER_EVMT2_MASK)

#define NETC_SW_COMMON_EVMIER_EVMT3_MASK         (0x8U)
#define NETC_SW_COMMON_EVMIER_EVMT3_SHIFT        (3U)
#define NETC_SW_COMMON_EVMIER_EVMT3_WIDTH        (1U)
#define NETC_SW_COMMON_EVMIER_EVMT3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIER_EVMT3_SHIFT)) & NETC_SW_COMMON_EVMIER_EVMT3_MASK)
/*! @} */

/*! @name EVMIDR - Event monitor interrupt detect register */
/*! @{ */

#define NETC_SW_COMMON_EVMIDR_EVT0_MASK          (0x1U)
#define NETC_SW_COMMON_EVMIDR_EVT0_SHIFT         (0U)
#define NETC_SW_COMMON_EVMIDR_EVT0_WIDTH         (1U)
#define NETC_SW_COMMON_EVMIDR_EVT0(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIDR_EVT0_SHIFT)) & NETC_SW_COMMON_EVMIDR_EVT0_MASK)

