zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_EVMIDR_EVT1_MASK          (0x2U)
#define NETC_SW_COMMON_EVMIDR_EVT1_SHIFT         (1U)
#define NETC_SW_COMMON_EVMIDR_EVT1_WIDTH         (1U)
#define NETC_SW_COMMON_EVMIDR_EVT1(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIDR_EVT1_SHIFT)) & NETC_SW_COMMON_EVMIDR_EVT1_MASK)

#define NETC_SW_COMMON_EVMIDR_EVT2_MASK          (0x4U)
#define NETC_SW_COMMON_EVMIDR_EVT2_SHIFT         (2U)
#define NETC_SW_COMMON_EVMIDR_EVT2_WIDTH         (1U)
#define NETC_SW_COMMON_EVMIDR_EVT2(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIDR_EVT2_SHIFT)) & NETC_SW_COMMON_EVMIDR_EVT2_MASK)

#define NETC_SW_COMMON_EVMIDR_EVT3_MASK          (0x8U)
#define NETC_SW_COMMON_EVMIDR_EVT3_SHIFT         (3U)
#define NETC_SW_COMMON_EVMIDR_EVT3_WIDTH         (1U)
#define NETC_SW_COMMON_EVMIDR_EVT3(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMIDR_EVT3_SHIFT)) & NETC_SW_COMMON_EVMIDR_EVT3_MASK)
/*! @} */

/*! @name EVMEIR - Event monitor event invocation register */
/*! @{ */

#define NETC_SW_COMMON_EVMEIR_EVENT_MASK         (0xFFU)
#define NETC_SW_COMMON_EVMEIR_EVENT_SHIFT        (0U)
#define NETC_SW_COMMON_EVMEIR_EVENT_WIDTH        (8U)
#define NETC_SW_COMMON_EVMEIR_EVENT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMEIR_EVENT_SHIFT)) & NETC_SW_COMMON_EVMEIR_EVENT_MASK)
/*! @} */

/*! @name EVMMSIVR - Event monitor MSI-X vector register */
/*! @{ */

#define NETC_SW_COMMON_EVMMSIVR_VECTOR_MASK      (0xFU)
#define NETC_SW_COMMON_EVMMSIVR_VECTOR_SHIFT     (0U)
#define NETC_SW_COMMON_EVMMSIVR_VECTOR_WIDTH     (4U)
#define NETC_SW_COMMON_EVMMSIVR_VECTOR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMMSIVR_VECTOR_SHIFT)) & NETC_SW_COMMON_EVMMSIVR_VECTOR_MASK)
/*! @} */

/*! @name CVLANR1 - Custom VLAN EtherType register 1 */
/*! @{ */

#define NETC_SW_COMMON_CVLANR1_ETYPE_MASK        (0xFFFFU)
#define NETC_SW_COMMON_CVLANR1_ETYPE_SHIFT       (0U)
#define NETC_SW_COMMON_CVLANR1_ETYPE_WIDTH       (16U)
#define NETC_SW_COMMON_CVLANR1_ETYPE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CVLANR1_ETYPE_SHIFT)) & NETC_SW_COMMON_CVLANR1_ETYPE_MASK)

#define NETC_SW_COMMON_CVLANR1_V_MASK            (0x80000000U)
#define NETC_SW_COMMON_CVLANR1_V_SHIFT           (31U)
#define NETC_SW_COMMON_CVLANR1_V_WIDTH           (1U)
#define NETC_SW_COMMON_CVLANR1_V(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CVLANR1_V_SHIFT)) & NETC_SW_COMMON_CVLANR1_V_MASK)
/*! @} */

/*! @name CVLANR2 - Custom VLAN EtherType register 2 */
/*! @{ */

#define NETC_SW_COMMON_CVLANR2_ETYPE_MASK        (0xFFFFU)
#define NETC_SW_COMMON_CVLANR2_ETYPE_SHIFT       (0U)
#define NETC_SW_COMMON_CVLANR2_ETYPE_WIDTH       (16U)
#define NETC_SW_COMMON_CVLANR2_ETYPE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CVLANR2_ETYPE_SHIFT)) & NETC_SW_COMMON_CVLANR2_ETYPE_MASK)

#define NETC_SW_COMMON_CVLANR2_V_MASK            (0x80000000U)
#define NETC_SW_COMMON_CVLANR2_V_SHIFT           (31U)
#define NETC_SW_COMMON_CVLANR2_V_WIDTH           (1U)
#define NETC_SW_COMMON_CVLANR2_V(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_CVLANR2_V_SHIFT)) & NETC_SW_COMMON_CVLANR2_V_MASK)
/*! @} */

/*! @name PSRTAGETR - Pre-Standard RTAG EtherType register */
/*! @{ */

#define NETC_SW_COMMON_PSRTAGETR_ETHERTYPE_MASK  (0xFFFFU)
#define NETC_SW_COMMON_PSRTAGETR_ETHERTYPE_SHIFT (0U)
#define NETC_SW_COMMON_PSRTAGETR_ETHERTYPE_WIDTH (16U)
#define NETC_SW_COMMON_PSRTAGETR_ETHERTYPE(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_PSRTAGETR_ETHERTYPE_SHIFT)) & NETC_SW_COMMON_PSRTAGETR_ETHERTYPE_MASK)
/*! @} */

/*! @name DOSL2CR - DoS L2 configuration register */
/*! @{ */

#define NETC_SW_COMMON_DOSL2CR_SAMEADDR_MASK     (0x1U)
#define NETC_SW_COMMON_DOSL2CR_SAMEADDR_SHIFT    (0U)
#define NETC_SW_COMMON_DOSL2CR_SAMEADDR_WIDTH    (1U)
#define NETC_SW_COMMON_DOSL2CR_SAMEADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_DOSL2CR_SAMEADDR_SHIFT)) & NETC_SW_COMMON_DOSL2CR_SAMEADDR_MASK)

#define NETC_SW_COMMON_DOSL2CR_MSAMCC_MASK       (0x2U)
#define NETC_SW_COMMON_DOSL2CR_MSAMCC_SHIFT      (1U)
#define NETC_SW_COMMON_DOSL2CR_MSAMCC_WIDTH      (1U)
#define NETC_SW_COMMON_DOSL2CR_MSAMCC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_DOSL2CR_MSAMCC_SHIFT)) & NETC_SW_COMMON_DOSL2CR_MSAMCC_MASK)
/*! @} */

/*! @name DOSL3CR - DoS L3 configuration register */
/*! @{ */

#define NETC_SW_COMMON_DOSL3CR_SAMEADDR_MASK     (0x1U)
#define NETC_SW_COMMON_DOSL3CR_SAMEADDR_SHIFT    (0U)
#define NETC_SW_COMMON_DOSL3CR_SAMEADDR_WIDTH    (1U)
#define NETC_SW_COMMON_DOSL3CR_SAMEADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_DOSL3CR_SAMEADDR_SHIFT)) & NETC_SW_COMMON_DOSL3CR_SAMEADDR_MASK)

#define NETC_SW_COMMON_DOSL3CR_IPSAMCC_MASK      (0x2U)
#define NETC_SW_COMMON_DOSL3CR_IPSAMCC_SHIFT     (1U)
#define NETC_SW_COMMON_DOSL3CR_IPSAMCC_WIDTH     (1U)
#define NETC_SW_COMMON_DOSL3CR_IPSAMCC(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_DOSL3CR_IPSAMCC_SHIFT)) & NETC_SW_COMMON_DOSL3CR_IPSAMCC_MASK)
/*! @} */

/*! @name VLANIPVMPR0 - VLAN to IPV mapping profile 0 register 0..VLAN to IPV mapping profile 1 register 0 */
/*! @{ */

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0_MASK (0x7U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0_SHIFT (0U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_0_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1_MASK (0x70U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1_SHIFT (4U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_1_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2_MASK (0x700U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2_SHIFT (8U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_2_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3_MASK (0x7000U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3_SHIFT (12U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_3_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4_MASK (0x70000U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4_SHIFT (16U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_4_MASK)

