zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5_MASK (0x700000U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5_SHIFT (20U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_5_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6_MASK (0x7000000U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6_SHIFT (24U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_6_MASK)

#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7_MASK (0x70000000U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7_SHIFT (28U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR0_PCP_DEI_7_MASK)
/*! @} */

/*! @name VLANIPVMPR1 - VLAN to IPV mapping profile 0 register 1..VLAN to IPV mapping profile 1 register 1 */
/*! @{ */

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8_MASK (0x7U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8_SHIFT (0U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_8_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9_MASK (0x70U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9_SHIFT (4U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_9_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10_MASK (0x700U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10_SHIFT (8U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_10_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11_MASK (0x7000U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11_SHIFT (12U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_11_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12_MASK (0x70000U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12_SHIFT (16U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_12_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13_MASK (0x700000U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13_SHIFT (20U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_13_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14_MASK (0x7000000U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14_SHIFT (24U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_14_MASK)

#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15_MASK (0x70000000U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15_SHIFT (28U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15_WIDTH (3U)
#define NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15_SHIFT)) & NETC_SW_COMMON_VLANIPVMPR1_PCP_DEI_15_MASK)
/*! @} */

/*! @name VLANDRMPR - VLAN to DR mapping profile 0 register..VLAN to DR mapping profile 1 register */
/*! @{ */

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0_MASK  (0x3U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0_SHIFT (0U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_0_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1_MASK  (0xCU)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1_SHIFT (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_1_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2_MASK  (0x30U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2_SHIFT (4U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_2_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3_MASK  (0xC0U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3_SHIFT (6U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_3_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4_MASK  (0x300U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4_SHIFT (8U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_4_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5_MASK  (0xC00U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5_SHIFT (10U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_5_MASK)

