zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6_MASK  (0x3000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6_SHIFT (12U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_6_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7_MASK  (0xC000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7_SHIFT (14U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_7_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8_MASK  (0x30000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8_SHIFT (16U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_8_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9_MASK  (0xC0000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9_SHIFT (18U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_9_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10_MASK (0x300000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10_SHIFT (20U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_10_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11_MASK (0xC00000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11_SHIFT (22U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_11_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12_MASK (0x3000000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12_SHIFT (24U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_12_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13_MASK (0xC000000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13_SHIFT (26U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_13_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14_MASK (0x30000000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14_SHIFT (28U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_14_MASK)

#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15_MASK (0xC0000000U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15_SHIFT (30U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15_WIDTH (2U)
#define NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15_SHIFT)) & NETC_SW_COMMON_VLANDRMPR_PCP_DEI_15_MASK)
/*! @} */

/*! @name IPFCAPR - Ingress port filter capability register */
/*! @{ */

#define NETC_SW_COMMON_IPFCAPR_RP_MASK           (0x1U)
#define NETC_SW_COMMON_IPFCAPR_RP_SHIFT          (0U)
#define NETC_SW_COMMON_IPFCAPR_RP_WIDTH          (1U)
#define NETC_SW_COMMON_IPFCAPR_RP(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPFCAPR_RP_SHIFT)) & NETC_SW_COMMON_IPFCAPR_RP_MASK)

#define NETC_SW_COMMON_IPFCAPR_ISID_MASK         (0x2U)
#define NETC_SW_COMMON_IPFCAPR_ISID_SHIFT        (1U)
#define NETC_SW_COMMON_IPFCAPR_ISID_WIDTH        (1U)
#define NETC_SW_COMMON_IPFCAPR_ISID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPFCAPR_ISID_SHIFT)) & NETC_SW_COMMON_IPFCAPR_ISID_MASK)
/*! @} */

/*! @name IPFTCAPR - Ingress port filter table capability register */
/*! @{ */

#define NETC_SW_COMMON_IPFTCAPR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_IPFTCAPR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_IPFTCAPR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_IPFTCAPR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPFTCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_IPFTCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_IPFTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_COMMON_IPFTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_COMMON_IPFTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_COMMON_IPFTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPFTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_IPFTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name IPFTMOR - Ingress port filter table memory operational register */
/*! @{ */

#define NETC_SW_COMMON_IPFTMOR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_IPFTMOR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_IPFTMOR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_IPFTMOR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_IPFTMOR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_IPFTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ITMCAPR - Index table memory capability register */
/*! @{ */

#define NETC_SW_COMMON_ITMCAPR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_ITMCAPR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_ITMCAPR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_ITMCAPR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ITMCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_ITMCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_ITMCAPR_WORD_SIZE_MASK    (0x30000000U)
#define NETC_SW_COMMON_ITMCAPR_WORD_SIZE_SHIFT   (28U)
#define NETC_SW_COMMON_ITMCAPR_WORD_SIZE_WIDTH   (2U)
#define NETC_SW_COMMON_ITMCAPR_WORD_SIZE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ITMCAPR_WORD_SIZE_SHIFT)) & NETC_SW_COMMON_ITMCAPR_WORD_SIZE_MASK)

#define NETC_SW_COMMON_ITMCAPR_MLOC_MASK         (0xC0000000U)
#define NETC_SW_COMMON_ITMCAPR_MLOC_SHIFT        (30U)
#define NETC_SW_COMMON_ITMCAPR_MLOC_WIDTH        (2U)
#define NETC_SW_COMMON_ITMCAPR_MLOC(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ITMCAPR_MLOC_SHIFT)) & NETC_SW_COMMON_ITMCAPR_MLOC_MASK)
/*! @} */

