zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/*! @name RPCAPR - Rate policer capability register */
/*! @{ */

#define NETC_SW_COMMON_RPCAPR_TRTCM_MASK         (0x1U)
#define NETC_SW_COMMON_RPCAPR_TRTCM_SHIFT        (0U)
#define NETC_SW_COMMON_RPCAPR_TRTCM_WIDTH        (1U)
#define NETC_SW_COMMON_RPCAPR_TRTCM(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPCAPR_TRTCM_SHIFT)) & NETC_SW_COMMON_RPCAPR_TRTCM_MASK)

#define NETC_SW_COMMON_RPCAPR_CM_MASK            (0x2U)
#define NETC_SW_COMMON_RPCAPR_CM_SHIFT           (1U)
#define NETC_SW_COMMON_RPCAPR_CM_WIDTH           (1U)
#define NETC_SW_COMMON_RPCAPR_CM(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPCAPR_CM_SHIFT)) & NETC_SW_COMMON_RPCAPR_CM_MASK)
/*! @} */

/*! @name RPITCAPR - Rate policer index table capability register */
/*! @{ */

#define NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_RPITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_RPITCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_COMMON_RPITCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_COMMON_RPITCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_COMMON_RPITCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_RPITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name RPITMAR - Rate policer index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_RPITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_RPITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_RPITMAR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_RPITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_RPITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name RPITOR - Rate policer index table operational register */
/*! @{ */

#define NETC_SW_COMMON_RPITOR_NUM_ENTRIES_MASK   (0x3FFFU)
#define NETC_SW_COMMON_RPITOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_COMMON_RPITOR_NUM_ENTRIES_WIDTH  (14U)
#define NETC_SW_COMMON_RPITOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_RPITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_RPITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISCITCAPR - Ingress stream counter index table capability register */
/*! @{ */

#define NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISCITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ISCITCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_ISCITCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_ISCITCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_ISCITCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ISCITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISCITMAR - Ingress stream counter index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_ISCITMAR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_ISCITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_ISCITMAR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_ISCITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_ISCITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISCITOR - Ingress stream counter index table operational register */
/*! @{ */

#define NETC_SW_COMMON_ISCITOR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_COMMON_ISCITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISCITOR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISCITOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISCITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISCAPR - Ingress stream capability register */
/*! @{ */

#define NETC_SW_COMMON_ISCAPR_ISQG_MASK          (0x2U)
#define NETC_SW_COMMON_ISCAPR_ISQG_SHIFT         (1U)
#define NETC_SW_COMMON_ISCAPR_ISQG_WIDTH         (1U)
#define NETC_SW_COMMON_ISCAPR_ISQG(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_ISQG_SHIFT)) & NETC_SW_COMMON_ISCAPR_ISQG_MASK)

#define NETC_SW_COMMON_ISCAPR_SG_MASK            (0x8U)
#define NETC_SW_COMMON_ISCAPR_SG_SHIFT           (3U)
#define NETC_SW_COMMON_ISCAPR_SG_WIDTH           (1U)
#define NETC_SW_COMMON_ISCAPR_SG(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_SG_SHIFT)) & NETC_SW_COMMON_ISCAPR_SG_MASK)

#define NETC_SW_COMMON_ISCAPR_RP_MASK            (0x10U)
#define NETC_SW_COMMON_ISCAPR_RP_SHIFT           (4U)
#define NETC_SW_COMMON_ISCAPR_RP_WIDTH           (1U)
#define NETC_SW_COMMON_ISCAPR_RP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_RP_SHIFT)) & NETC_SW_COMMON_ISCAPR_RP_MASK)

#define NETC_SW_COMMON_ISCAPR_MAXSDU_MASK        (0x20U)
#define NETC_SW_COMMON_ISCAPR_MAXSDU_SHIFT       (5U)
#define NETC_SW_COMMON_ISCAPR_MAXSDU_WIDTH       (1U)
#define NETC_SW_COMMON_ISCAPR_MAXSDU(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_MAXSDU_SHIFT)) & NETC_SW_COMMON_ISCAPR_MAXSDU_MASK)

#define NETC_SW_COMMON_ISCAPR_FWD_MASK           (0x200U)
#define NETC_SW_COMMON_ISCAPR_FWD_SHIFT          (9U)
#define NETC_SW_COMMON_ISCAPR_FWD_WIDTH          (1U)
#define NETC_SW_COMMON_ISCAPR_FWD(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_FWD_SHIFT)) & NETC_SW_COMMON_ISCAPR_FWD_MASK)

#define NETC_SW_COMMON_ISCAPR_ET_MASK            (0x400U)
#define NETC_SW_COMMON_ISCAPR_ET_SHIFT           (10U)
#define NETC_SW_COMMON_ISCAPR_ET_WIDTH           (1U)
#define NETC_SW_COMMON_ISCAPR_ET(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISCAPR_ET_SHIFT)) & NETC_SW_COMMON_ISCAPR_ET_MASK)
/*! @} */

/*! @name ISITCAPR - Ingress stream index table capability register */
/*! @{ */

#define NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ISITCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_COMMON_ISITCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_COMMON_ISITCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_COMMON_ISITCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ISITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISITMAR - Ingress stream index table memory allocation register */
/*! @{ */

