zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_ISITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_ISITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_ISITMAR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_ISITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_ISITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISITOR - Ingress stream index table operational register */
/*! @{ */

#define NETC_SW_COMMON_ISITOR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_COMMON_ISITOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_COMMON_ISITOR_NUM_ENTRIES_WIDTH  (16U)
#define NETC_SW_COMMON_ISITOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISQGITCAPR - Ingress sequence generation index table capability register */
/*! @{ */

#define NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISQGITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ISQGITCAPR_VERSIONS_MASK  (0xFFFF0000U)
#define NETC_SW_COMMON_ISQGITCAPR_VERSIONS_SHIFT (16U)
#define NETC_SW_COMMON_ISQGITCAPR_VERSIONS_WIDTH (16U)
#define NETC_SW_COMMON_ISQGITCAPR_VERSIONS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISQGITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ISQGITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISQGITMAR - Ingress sequence generation index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_ISQGITMAR_NUM_WORDS_MASK  (0x1FFFU)
#define NETC_SW_COMMON_ISQGITMAR_NUM_WORDS_SHIFT (0U)
#define NETC_SW_COMMON_ISQGITMAR_NUM_WORDS_WIDTH (13U)
#define NETC_SW_COMMON_ISQGITMAR_NUM_WORDS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISQGITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_ISQGITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISQGITOR - Ingress sequence generation index table operational register */
/*! @{ */

#define NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISQGITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCAPR - Stream gate capability register */
/*! @{ */

#define NETC_SW_COMMON_SGCAPR_GLC_AO_MASK        (0x1U)
#define NETC_SW_COMMON_SGCAPR_GLC_AO_SHIFT       (0U)
#define NETC_SW_COMMON_SGCAPR_GLC_AO_WIDTH       (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_AO(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCAPR_GLC_AO_SHIFT)) & NETC_SW_COMMON_SGCAPR_GLC_AO_MASK)

#define NETC_SW_COMMON_SGCAPR_GLC_GC_MASK        (0x2U)
#define NETC_SW_COMMON_SGCAPR_GLC_GC_SHIFT       (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_GC_WIDTH       (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_GC(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCAPR_GLC_GC_SHIFT)) & NETC_SW_COMMON_SGCAPR_GLC_GC_MASK)

#define NETC_SW_COMMON_SGCAPR_GLC_IO_MASK        (0x4U)
#define NETC_SW_COMMON_SGCAPR_GLC_IO_SHIFT       (2U)
#define NETC_SW_COMMON_SGCAPR_GLC_IO_WIDTH       (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_IO(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCAPR_GLC_IO_SHIFT)) & NETC_SW_COMMON_SGCAPR_GLC_IO_MASK)

#define NETC_SW_COMMON_SGCAPR_GLC_IPV_MASK       (0x8U)
#define NETC_SW_COMMON_SGCAPR_GLC_IPV_SHIFT      (3U)
#define NETC_SW_COMMON_SGCAPR_GLC_IPV_WIDTH      (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_IPV(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCAPR_GLC_IPV_SHIFT)) & NETC_SW_COMMON_SGCAPR_GLC_IPV_MASK)

#define NETC_SW_COMMON_SGCAPR_GLC_CTD_MASK       (0x10U)
#define NETC_SW_COMMON_SGCAPR_GLC_CTD_SHIFT      (4U)
#define NETC_SW_COMMON_SGCAPR_GLC_CTD_WIDTH      (1U)
#define NETC_SW_COMMON_SGCAPR_GLC_CTD(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCAPR_GLC_CTD_SHIFT)) & NETC_SW_COMMON_SGCAPR_GLC_CTD_MASK)
/*! @} */

/*! @name SGIITCAPR - Stream gate instance index table capability register */
/*! @{ */

#define NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_SGIITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_SGIITCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_SGIITCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_SGIITCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_SGIITCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGIITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_SGIITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SGIITMAR - Stream gate instance index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_SGIITMAR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_SGIITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_SGIITMAR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_SGIITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGIITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_SGIITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGIITOR - Stream gate instance index table operational register */
/*! @{ */

#define NETC_SW_COMMON_SGIITOR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_COMMON_SGIITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_SGIITOR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_SGIITOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGIITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_SGIITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCLITCAPR - Stream gate control list index table capability register */
/*! @{ */

#define NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS_MASK (0xFFFFU)
#define NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS_SHIFT (0U)
#define NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS_WIDTH (16U)
#define NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_SGCLITCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_SGCLITCAPR_VERSIONS_MASK  (0xFFFF0000U)
#define NETC_SW_COMMON_SGCLITCAPR_VERSIONS_SHIFT (16U)
#define NETC_SW_COMMON_SGCLITCAPR_VERSIONS_WIDTH (16U)
#define NETC_SW_COMMON_SGCLITCAPR_VERSIONS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCLITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_SGCLITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SGCLITMAR - Stream gate control list index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_SGCLITMAR_NUM_WORDS_MASK  (0xFFFFU)
#define NETC_SW_COMMON_SGCLITMAR_NUM_WORDS_SHIFT (0U)
#define NETC_SW_COMMON_SGCLITMAR_NUM_WORDS_WIDTH (16U)
#define NETC_SW_COMMON_SGCLITMAR_NUM_WORDS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCLITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_SGCLITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGCLTMOR - Stream gate control list table memory operational register */
/*! @{ */

#define NETC_SW_COMMON_SGCLTMOR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_SGCLTMOR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_SGCLTMOR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_SGCLTMOR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_SGCLTMOR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_SGCLTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name FMICAPR - Frame modification ingress capability register */
/*! @{ */

#define NETC_SW_COMMON_FMICAPR_L2_ACT_MASK       (0xFFU)
#define NETC_SW_COMMON_FMICAPR_L2_ACT_SHIFT      (0U)
#define NETC_SW_COMMON_FMICAPR_L2_ACT_WIDTH      (8U)
#define NETC_SW_COMMON_FMICAPR_L2_ACT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMICAPR_L2_ACT_SHIFT)) & NETC_SW_COMMON_FMICAPR_L2_ACT_MASK)
/*! @} */

