zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/*! @name FMECAPR - Frame modification egress capability register */
/*! @{ */

#define NETC_SW_COMMON_FMECAPR_L2_ACT_MASK       (0xFFU)
#define NETC_SW_COMMON_FMECAPR_L2_ACT_SHIFT      (0U)
#define NETC_SW_COMMON_FMECAPR_L2_ACT_WIDTH      (8U)
#define NETC_SW_COMMON_FMECAPR_L2_ACT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMECAPR_L2_ACT_SHIFT)) & NETC_SW_COMMON_FMECAPR_L2_ACT_MASK)

#define NETC_SW_COMMON_FMECAPR_L3_ACT_MASK       (0xFF0000U)
#define NETC_SW_COMMON_FMECAPR_L3_ACT_SHIFT      (16U)
#define NETC_SW_COMMON_FMECAPR_L3_ACT_WIDTH      (8U)
#define NETC_SW_COMMON_FMECAPR_L3_ACT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMECAPR_L3_ACT_SHIFT)) & NETC_SW_COMMON_FMECAPR_L3_ACT_MASK)
/*! @} */

/*! @name FMITCAPR - Frame modification index table capability register */
/*! @{ */

#define NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_FMITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_FMITCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_COMMON_FMITCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_COMMON_FMITCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_COMMON_FMITCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_FMITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name FMITMAR - Frame modification index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_FMITMAR_NUM_WORDS_MASK    (0x1FFFU)
#define NETC_SW_COMMON_FMITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_FMITMAR_NUM_WORDS_WIDTH   (13U)
#define NETC_SW_COMMON_FMITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_FMITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name FMITOR - Frame modification index table operational register */
/*! @{ */

#define NETC_SW_COMMON_FMITOR_NUM_ENTRIES_MASK   (0x1FFFU)
#define NETC_SW_COMMON_FMITOR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_COMMON_FMITOR_NUM_ENTRIES_WIDTH  (13U)
#define NETC_SW_COMMON_FMITOR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_FMITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name FMDITCAPR - Frame modification data index table capability register */
/*! @{ */

#define NETC_SW_COMMON_FMDITCAPR_NUM_WORDS_MASK  (0xFFFFU)
#define NETC_SW_COMMON_FMDITCAPR_NUM_WORDS_SHIFT (0U)
#define NETC_SW_COMMON_FMDITCAPR_NUM_WORDS_WIDTH (16U)
#define NETC_SW_COMMON_FMDITCAPR_NUM_WORDS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMDITCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_FMDITCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_FMDITCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_FMDITCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_FMDITCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_FMDITCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMDITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_FMDITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name FMDITMAR - Frame modification data index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_FMDITMAR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_FMDITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_FMDITMAR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_FMDITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_FMDITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_FMDITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ASGITCAPR - ATS scheduler group index table capability register */
/*! @{ */

#define NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ASGITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ASGITCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_ASGITCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_ASGITCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_ASGITCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASGITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ASGITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ASGITOR - ATS scheduler group index table operational register */
/*! @{ */

#define NETC_SW_COMMON_ASGITOR_NUM_ENTRIES_MASK  (0x1FFFU)
#define NETC_SW_COMMON_ASGITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ASGITOR_NUM_ENTRIES_WIDTH (13U)
#define NETC_SW_COMMON_ASGITOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASGITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ASGITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ASIITCAPR - ATS scheduler instance index table capability register */
/*! @{ */

#define NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ASIITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ASIITCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_ASIITCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_ASIITCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_ASIITCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASIITCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ASIITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ASIITMAR - ATS scheduler instance index table memory allocation register */
/*! @{ */

#define NETC_SW_COMMON_ASIITMAR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_ASIITMAR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_ASIITMAR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_ASIITMAR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASIITMAR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_ASIITMAR_NUM_WORDS_MASK)
/*! @} */

