zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
/*! @name ASIITOR - ATS scheduler instance Index table operational register */
/*! @{ */

#define NETC_SW_COMMON_ASIITOR_NUM_ENTRIES_MASK  (0x1FFFU)
#define NETC_SW_COMMON_ASIITOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ASIITOR_NUM_ENTRIES_WIDTH (13U)
#define NETC_SW_COMMON_ASIITOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ASIITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ASIITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ETCAPR - Egress treatment capability register */
/*! @{ */

#define NETC_SW_COMMON_ETCAPR_ESQR_MASK          (0x1U)
#define NETC_SW_COMMON_ETCAPR_ESQR_SHIFT         (0U)
#define NETC_SW_COMMON_ETCAPR_ESQR_WIDTH         (1U)
#define NETC_SW_COMMON_ETCAPR_ESQR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ETCAPR_ESQR_SHIFT)) & NETC_SW_COMMON_ETCAPR_ESQR_MASK)
/*! @} */

/*! @name ETTCAPR - Egress treatment table capability register */
/*! @{ */

#define NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ETTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ETTCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define NETC_SW_COMMON_ETTCAPR_VERSIONS_SHIFT    (16U)
#define NETC_SW_COMMON_ETTCAPR_VERSIONS_WIDTH    (16U)
#define NETC_SW_COMMON_ETTCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ETTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ETTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ETTOR - Egress treatment table operational register */
/*! @{ */

#define NETC_SW_COMMON_ETTOR_NUM_ENTRIES_MASK    (0xFFFFU)
#define NETC_SW_COMMON_ETTOR_NUM_ENTRIES_SHIFT   (0U)
#define NETC_SW_COMMON_ETTOR_NUM_ENTRIES_WIDTH   (16U)
#define NETC_SW_COMMON_ETTOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ETTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ETTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name TGSTCAPR - Time gate scheduling table capability register */
/*! @{ */

#define NETC_SW_COMMON_TGSTCAPR_NUM_WORDS_MASK   (0xFFFFU)
#define NETC_SW_COMMON_TGSTCAPR_NUM_WORDS_SHIFT  (0U)
#define NETC_SW_COMMON_TGSTCAPR_NUM_WORDS_WIDTH  (16U)
#define NETC_SW_COMMON_TGSTCAPR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TGSTCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_TGSTCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_TGSTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define NETC_SW_COMMON_TGSTCAPR_VERSIONS_SHIFT   (16U)
#define NETC_SW_COMMON_TGSTCAPR_VERSIONS_WIDTH   (16U)
#define NETC_SW_COMMON_TGSTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TGSTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_TGSTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name TGSTMOR - Time gate scheduling table memory operation register */
/*! @{ */

#define NETC_SW_COMMON_TGSTMOR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_TGSTMOR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_TGSTMOR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_TGSTMOR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_TGSTMOR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_TGSTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ESQRCAPR - Egress sequence recovery capability register */
/*! @{ */

#define NETC_SW_COMMON_ESQRCAPR_SQR_TYPE_MASK    (0x3U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_TYPE_SHIFT   (0U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_TYPE_WIDTH   (2U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_TYPE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ESQRCAPR_SQR_TYPE_SHIFT)) & NETC_SW_COMMON_ESQRCAPR_SQR_TYPE_MASK)

#define NETC_SW_COMMON_ESQRCAPR_SQR_ALG_MASK     (0xCU)
#define NETC_SW_COMMON_ESQRCAPR_SQR_ALG_SHIFT    (2U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_ALG_WIDTH    (2U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_ALG(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ESQRCAPR_SQR_ALG_SHIFT)) & NETC_SW_COMMON_ESQRCAPR_SQR_ALG_MASK)

#define NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL_MASK  (0x700U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL_SHIFT (8U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL_WIDTH (3U)
#define NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL_SHIFT)) & NETC_SW_COMMON_ESQRCAPR_SQR_MAX_HL_MASK)
/*! @} */

/*! @name ESQRTCAPR - Egress sequence recovery table capability register */
/*! @{ */

#define NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ESQRTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ESQRTCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_ESQRTCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_ESQRTCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_ESQRTCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ESQRTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ESQRTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ECTCAPR - Egress counter table capability register */
/*! @{ */

#define NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ECTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ECTCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define NETC_SW_COMMON_ECTCAPR_VERSIONS_SHIFT    (16U)
#define NETC_SW_COMMON_ECTCAPR_VERSIONS_WIDTH    (16U)
#define NETC_SW_COMMON_ECTCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ECTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ECTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name HTMCAPR - Hash table memory capability register */
/*! @{ */

#define NETC_SW_COMMON_HTMCAPR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_COMMON_HTMCAPR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_COMMON_HTMCAPR_NUM_WORDS_WIDTH   (16U)
#define NETC_SW_COMMON_HTMCAPR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_HTMCAPR_NUM_WORDS_SHIFT)) & NETC_SW_COMMON_HTMCAPR_NUM_WORDS_MASK)

#define NETC_SW_COMMON_HTMCAPR_WORD_SIZE_MASK    (0x30000000U)
#define NETC_SW_COMMON_HTMCAPR_WORD_SIZE_SHIFT   (28U)
#define NETC_SW_COMMON_HTMCAPR_WORD_SIZE_WIDTH   (2U)
#define NETC_SW_COMMON_HTMCAPR_WORD_SIZE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_HTMCAPR_WORD_SIZE_SHIFT)) & NETC_SW_COMMON_HTMCAPR_WORD_SIZE_MASK)

