zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_HTMCAPR_MLOC_MASK         (0xC0000000U)
#define NETC_SW_COMMON_HTMCAPR_MLOC_SHIFT        (30U)
#define NETC_SW_COMMON_HTMCAPR_MLOC_WIDTH        (2U)
#define NETC_SW_COMMON_HTMCAPR_MLOC(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_HTMCAPR_MLOC_SHIFT)) & NETC_SW_COMMON_HTMCAPR_MLOC_MASK)
/*! @} */

/*! @name HTMOR - Hash table memory operational register */
/*! @{ */

#define NETC_SW_COMMON_HTMOR_AMOUNT_MASK         (0xFFFFU)
#define NETC_SW_COMMON_HTMOR_AMOUNT_SHIFT        (0U)
#define NETC_SW_COMMON_HTMOR_AMOUNT_WIDTH        (16U)
#define NETC_SW_COMMON_HTMOR_AMOUNT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_HTMOR_AMOUNT_SHIFT)) & NETC_SW_COMMON_HTMOR_AMOUNT_MASK)

#define NETC_SW_COMMON_HTMOR_WATERMARK_MASK      (0xFFFF0000U)
#define NETC_SW_COMMON_HTMOR_WATERMARK_SHIFT     (16U)
#define NETC_SW_COMMON_HTMOR_WATERMARK_WIDTH     (16U)
#define NETC_SW_COMMON_HTMOR_WATERMARK(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_HTMOR_WATERMARK_SHIFT)) & NETC_SW_COMMON_HTMOR_WATERMARK_MASK)
/*! @} */

/*! @name ISIDCAPR - Ingress stream identification capability register */
/*! @{ */

#define NETC_SW_COMMON_ISIDCAPR_NUM_KC_MASK      (0x3U)
#define NETC_SW_COMMON_ISIDCAPR_NUM_KC_SHIFT     (0U)
#define NETC_SW_COMMON_ISIDCAPR_NUM_KC_WIDTH     (2U)
#define NETC_SW_COMMON_ISIDCAPR_NUM_KC(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDCAPR_NUM_KC_SHIFT)) & NETC_SW_COMMON_ISIDCAPR_NUM_KC_MASK)

#define NETC_SW_COMMON_ISIDCAPR_NUM_PF_MASK      (0x1CU)
#define NETC_SW_COMMON_ISIDCAPR_NUM_PF_SHIFT     (2U)
#define NETC_SW_COMMON_ISIDCAPR_NUM_PF_WIDTH     (3U)
#define NETC_SW_COMMON_ISIDCAPR_NUM_PF(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDCAPR_NUM_PF_SHIFT)) & NETC_SW_COMMON_ISIDCAPR_NUM_PF_MASK)

#define NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE_MASK   (0x1F00U)
#define NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE_SHIFT  (8U)
#define NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE_WIDTH  (5U)
#define NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE_SHIFT)) & NETC_SW_COMMON_ISIDCAPR_MAX_KSIZE_MASK)

#define NETC_SW_COMMON_ISIDCAPR_UFT_MASK         (0x10000U)
#define NETC_SW_COMMON_ISIDCAPR_UFT_SHIFT        (16U)
#define NETC_SW_COMMON_ISIDCAPR_UFT_WIDTH        (1U)
#define NETC_SW_COMMON_ISIDCAPR_UFT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDCAPR_UFT_SHIFT)) & NETC_SW_COMMON_ISIDCAPR_UFT_MASK)

#define NETC_SW_COMMON_ISIDCAPR_ETHFT_MASK       (0x20000U)
#define NETC_SW_COMMON_ISIDCAPR_ETHFT_SHIFT      (17U)
#define NETC_SW_COMMON_ISIDCAPR_ETHFT_WIDTH      (1U)
#define NETC_SW_COMMON_ISIDCAPR_ETHFT(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDCAPR_ETHFT_SHIFT)) & NETC_SW_COMMON_ISIDCAPR_ETHFT_MASK)
/*! @} */

/*! @name ISIDHTCAPR - Ingress stream identification hash table capability register */
/*! @{ */

#define NETC_SW_COMMON_ISIDHTCAPR_VERSIONS_MASK  (0xFFFF0000U)
#define NETC_SW_COMMON_ISIDHTCAPR_VERSIONS_SHIFT (16U)
#define NETC_SW_COMMON_ISIDHTCAPR_VERSIONS_WIDTH (16U)
#define NETC_SW_COMMON_ISIDHTCAPR_VERSIONS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDHTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ISIDHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISIDKC0OR - Ingress stream identification key construction 0 operational register */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISIDKC0OR_NUM_ENTRIES_MASK)

#define NETC_SW_COMMON_ISIDKC0OR_EN_MASK         (0x80000000U)
#define NETC_SW_COMMON_ISIDKC0OR_EN_SHIFT        (31U)
#define NETC_SW_COMMON_ISIDKC0OR_EN_WIDTH        (1U)
#define NETC_SW_COMMON_ISIDKC0OR_EN(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0OR_EN_SHIFT)) & NETC_SW_COMMON_ISIDKC0OR_EN_MASK)
/*! @} */

/*! @name ISIDKC0CR0 - Ingress stream identification key construction 0 configuration register 0 */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC0CR0_VALID_MASK     (0x1U)
#define NETC_SW_COMMON_ISIDKC0CR0_VALID_SHIFT    (0U)
#define NETC_SW_COMMON_ISIDKC0CR0_VALID_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_VALID(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_VALID_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_VALID_MASK)

#define NETC_SW_COMMON_ISIDKC0CR0_PORTP_MASK     (0x2U)
#define NETC_SW_COMMON_ISIDKC0CR0_PORTP_SHIFT    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_PORTP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_PORTP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_PORTP_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_PORTP_MASK)

#define NETC_SW_COMMON_ISIDKC0CR0_SPMP_MASK      (0x4U)
#define NETC_SW_COMMON_ISIDKC0CR0_SPMP_SHIFT     (2U)
#define NETC_SW_COMMON_ISIDKC0CR0_SPMP_WIDTH     (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_SPMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_SPMP_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_SPMP_MASK)

#define NETC_SW_COMMON_ISIDKC0CR0_DMACP_MASK     (0x8U)
#define NETC_SW_COMMON_ISIDKC0CR0_DMACP_SHIFT    (3U)
#define NETC_SW_COMMON_ISIDKC0CR0_DMACP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_DMACP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_DMACP_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_DMACP_MASK)

#define NETC_SW_COMMON_ISIDKC0CR0_SMACP_MASK     (0x10U)
#define NETC_SW_COMMON_ISIDKC0CR0_SMACP_SHIFT    (4U)
#define NETC_SW_COMMON_ISIDKC0CR0_SMACP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_SMACP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_SMACP_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_SMACP_MASK)

#define NETC_SW_COMMON_ISIDKC0CR0_OVIDP_MASK     (0x20U)
#define NETC_SW_COMMON_ISIDKC0CR0_OVIDP_SHIFT    (5U)
#define NETC_SW_COMMON_ISIDKC0CR0_OVIDP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC0CR0_OVIDP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC0CR0_OVIDP_SHIFT)) & NETC_SW_COMMON_ISIDKC0CR0_OVIDP_MASK)

