zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_ISIDKC3CR0_PORTP_MASK     (0x2U)
#define NETC_SW_COMMON_ISIDKC3CR0_PORTP_SHIFT    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_PORTP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_PORTP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_PORTP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_PORTP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_SPMP_MASK      (0x4U)
#define NETC_SW_COMMON_ISIDKC3CR0_SPMP_SHIFT     (2U)
#define NETC_SW_COMMON_ISIDKC3CR0_SPMP_WIDTH     (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_SPMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_SPMP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_SPMP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_DMACP_MASK     (0x8U)
#define NETC_SW_COMMON_ISIDKC3CR0_DMACP_SHIFT    (3U)
#define NETC_SW_COMMON_ISIDKC3CR0_DMACP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_DMACP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_DMACP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_DMACP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_SMACP_MASK     (0x10U)
#define NETC_SW_COMMON_ISIDKC3CR0_SMACP_SHIFT    (4U)
#define NETC_SW_COMMON_ISIDKC3CR0_SMACP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_SMACP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_SMACP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_SMACP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_OVIDP_MASK     (0x20U)
#define NETC_SW_COMMON_ISIDKC3CR0_OVIDP_SHIFT    (5U)
#define NETC_SW_COMMON_ISIDKC3CR0_OVIDP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_OVIDP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_OVIDP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_OVIDP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_OPCPP_MASK     (0x40U)
#define NETC_SW_COMMON_ISIDKC3CR0_OPCPP_SHIFT    (6U)
#define NETC_SW_COMMON_ISIDKC3CR0_OPCPP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_OPCPP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_OPCPP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_OPCPP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_IVIDP_MASK     (0x80U)
#define NETC_SW_COMMON_ISIDKC3CR0_IVIDP_SHIFT    (7U)
#define NETC_SW_COMMON_ISIDKC3CR0_IVIDP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_IVIDP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_IVIDP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_IVIDP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_IPCPP_MASK     (0x100U)
#define NETC_SW_COMMON_ISIDKC3CR0_IPCPP_SHIFT    (8U)
#define NETC_SW_COMMON_ISIDKC3CR0_IPCPP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_IPCPP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_IPCPP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_IPCPP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_SQTP_MASK      (0x200U)
#define NETC_SW_COMMON_ISIDKC3CR0_SQTP_SHIFT     (9U)
#define NETC_SW_COMMON_ISIDKC3CR0_SQTP_WIDTH     (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_SQTP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_SQTP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_SQTP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_ETP_MASK       (0x400U)
#define NETC_SW_COMMON_ISIDKC3CR0_ETP_SHIFT      (10U)
#define NETC_SW_COMMON_ISIDKC3CR0_ETP_WIDTH      (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_ETP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_ETP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_ETP_MASK)

#define NETC_SW_COMMON_ISIDKC3CR0_CTRLPP_MASK    (0x1000U)
#define NETC_SW_COMMON_ISIDKC3CR0_CTRLPP_SHIFT   (12U)
#define NETC_SW_COMMON_ISIDKC3CR0_CTRLPP_WIDTH   (1U)
#define NETC_SW_COMMON_ISIDKC3CR0_CTRLPP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3CR0_CTRLPP_SHIFT)) & NETC_SW_COMMON_ISIDKC3CR0_CTRLPP_MASK)
/*! @} */

/*! @name ISIDKC3PF0CR - Ingress stream identification key construction 3 payload field 0 configuration register */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC3PF0CR_PFP_MASK     (0x1U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_PFP_SHIFT    (0U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_PFP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_PFP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF0CR_PFP_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF0CR_PFP_MASK)

#define NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES_WIDTH (4U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF0CR_NUM_BYTES_MASK)

#define NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET_WIDTH (7U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF0CR_BYTE_OFFSET_MASK)

#define NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK_MASK  (0x70000U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK_SHIFT (16U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF0CR_FBMASK_MASK)

#define NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK_MASK  (0x700000U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK_SHIFT (20U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF0CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF1CR - Ingress stream identification key construction 3 payload field 1 configuration register */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC3PF1CR_PFP_MASK     (0x1U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_PFP_SHIFT    (0U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_PFP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_PFP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF1CR_PFP_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF1CR_PFP_MASK)

#define NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES_WIDTH (4U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF1CR_NUM_BYTES_MASK)

