zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET_WIDTH (7U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF1CR_BYTE_OFFSET_MASK)

#define NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK_MASK  (0x70000U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK_SHIFT (16U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF1CR_FBMASK_MASK)

#define NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK_MASK  (0x700000U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK_SHIFT (20U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF1CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF2CR - Ingress stream identification key construction 3 payload field 2 configuration register */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC3PF2CR_PFP_MASK     (0x1U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_PFP_SHIFT    (0U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_PFP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_PFP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF2CR_PFP_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF2CR_PFP_MASK)

#define NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES_WIDTH (4U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF2CR_NUM_BYTES_MASK)

#define NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET_WIDTH (7U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF2CR_BYTE_OFFSET_MASK)

#define NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK_MASK  (0x70000U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK_SHIFT (16U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF2CR_FBMASK_MASK)

#define NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK_MASK  (0x700000U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK_SHIFT (20U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF2CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC3PF3CR - Ingress stream identification key construction 3 payload field 3 configuration register */
/*! @{ */

#define NETC_SW_COMMON_ISIDKC3PF3CR_PFP_MASK     (0x1U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_PFP_SHIFT    (0U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_PFP_WIDTH    (1U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_PFP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF3CR_PFP_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF3CR_PFP_MASK)

#define NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES_WIDTH (4U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF3CR_NUM_BYTES_MASK)

#define NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET_WIDTH (7U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF3CR_BYTE_OFFSET_MASK)

#define NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK_MASK  (0x70000U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK_SHIFT (16U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF3CR_FBMASK_MASK)

#define NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK_MASK  (0x700000U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK_SHIFT (20U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK_WIDTH (3U)
#define NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK_SHIFT)) & NETC_SW_COMMON_ISIDKC3PF3CR_LBMASK_MASK)
/*! @} */

/*! @name ISFHTCAPR - Ingress stream filter hash table capability register */
/*! @{ */

#define NETC_SW_COMMON_ISFHTCAPR_VERSIONS_MASK   (0xFFFF0000U)
#define NETC_SW_COMMON_ISFHTCAPR_VERSIONS_SHIFT  (16U)
#define NETC_SW_COMMON_ISFHTCAPR_VERSIONS_WIDTH  (16U)
#define NETC_SW_COMMON_ISFHTCAPR_VERSIONS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISFHTCAPR_VERSIONS_SHIFT)) & NETC_SW_COMMON_ISFHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISFHTOR - Ingress stream filter hash table operational register */
/*! @{ */

#define NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES_MASK  (0xFFFFU)
#define NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES_WIDTH (16U)
#define NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_COMMON_ISFHTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name EVMCFGCR - Event monitor 0 configuration and control register..Event monitor 3 configuration and control register */
/*! @{ */

#define NETC_SW_COMMON_EVMCFGCR_EVBSEL_MASK      (0xFFU)
#define NETC_SW_COMMON_EVMCFGCR_EVBSEL_SHIFT     (0U)
#define NETC_SW_COMMON_EVMCFGCR_EVBSEL_WIDTH     (8U)
#define NETC_SW_COMMON_EVMCFGCR_EVBSEL(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_EVBSEL_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_EVBSEL_MASK)

