zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_SW_COMMON.h
#define NETC_SW_COMMON_EVMCFGCR_EVASEL_MASK      (0xFF00U)
#define NETC_SW_COMMON_EVMCFGCR_EVASEL_SHIFT     (8U)
#define NETC_SW_COMMON_EVMCFGCR_EVASEL_WIDTH     (8U)
#define NETC_SW_COMMON_EVMCFGCR_EVASEL(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_EVASEL_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_EVASEL_MASK)

#define NETC_SW_COMMON_EVMCFGCR_TBSEL_MASK       (0xF0000U)
#define NETC_SW_COMMON_EVMCFGCR_TBSEL_SHIFT      (16U)
#define NETC_SW_COMMON_EVMCFGCR_TBSEL_WIDTH      (4U)
#define NETC_SW_COMMON_EVMCFGCR_TBSEL(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_TBSEL_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_TBSEL_MASK)

#define NETC_SW_COMMON_EVMCFGCR_MM_MASK          (0xF00000U)
#define NETC_SW_COMMON_EVMCFGCR_MM_SHIFT         (20U)
#define NETC_SW_COMMON_EVMCFGCR_MM_WIDTH         (4U)
#define NETC_SW_COMMON_EVMCFGCR_MM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_MM_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_MM_MASK)

#define NETC_SW_COMMON_EVMCFGCR_RM_MASK          (0xF000000U)
#define NETC_SW_COMMON_EVMCFGCR_RM_SHIFT         (24U)
#define NETC_SW_COMMON_EVMCFGCR_RM_WIDTH         (4U)
#define NETC_SW_COMMON_EVMCFGCR_RM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_RM_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_RM_MASK)

#define NETC_SW_COMMON_EVMCFGCR_STATE_MASK       (0x70000000U)
#define NETC_SW_COMMON_EVMCFGCR_STATE_SHIFT      (28U)
#define NETC_SW_COMMON_EVMCFGCR_STATE_WIDTH      (3U)
#define NETC_SW_COMMON_EVMCFGCR_STATE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_STATE_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_STATE_MASK)

#define NETC_SW_COMMON_EVMCFGCR_TRIG_MASK        (0x80000000U)
#define NETC_SW_COMMON_EVMCFGCR_TRIG_SHIFT       (31U)
#define NETC_SW_COMMON_EVMCFGCR_TRIG_WIDTH       (1U)
#define NETC_SW_COMMON_EVMCFGCR_TRIG(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMCFGCR_TRIG_SHIFT)) & NETC_SW_COMMON_EVMCFGCR_TRIG_MASK)
/*! @} */

/*! @name EVMMR - Event monitor 0 measuring register..Event monitor 3 measuring register */
/*! @{ */

#define NETC_SW_COMMON_EVMMR_MEASURE_MASK        (0xFFFFFFFFU)
#define NETC_SW_COMMON_EVMMR_MEASURE_SHIFT       (0U)
#define NETC_SW_COMMON_EVMMR_MEASURE_WIDTH       (32U)
#define NETC_SW_COMMON_EVMMR_MEASURE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMMR_MEASURE_SHIFT)) & NETC_SW_COMMON_EVMMR_MEASURE_MASK)
/*! @} */

/*! @name EVMRR - Event monitor 0 reporting register..Event monitor 3 reporting register */
/*! @{ */

#define NETC_SW_COMMON_EVMRR_REPORT_MASK         (0xFFFFFFFFU)
#define NETC_SW_COMMON_EVMRR_REPORT_SHIFT        (0U)
#define NETC_SW_COMMON_EVMRR_REPORT_WIDTH        (32U)
#define NETC_SW_COMMON_EVMRR_REPORT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMRR_REPORT_SHIFT)) & NETC_SW_COMMON_EVMRR_REPORT_MASK)
/*! @} */

/*! @name EVMSRR - Event monitor 0 special reporting register..Event monitor 3 special reporting register */
/*! @{ */

#define NETC_SW_COMMON_EVMSRR_REPORT_MASK        (0xFFFFFFFFU)
#define NETC_SW_COMMON_EVMSRR_REPORT_SHIFT       (0U)
#define NETC_SW_COMMON_EVMSRR_REPORT_WIDTH       (32U)
#define NETC_SW_COMMON_EVMSRR_REPORT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_COMMON_EVMSRR_REPORT_SHIFT)) & NETC_SW_COMMON_EVMSRR_REPORT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group NETC_SW_COMMON_Register_Masks */

/*!
 * @}
 */ /* end of group NETC_SW_COMMON_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_NETC_SW_COMMON_H_) */
